[
  {
    "title": "Are Video Models Ready as Zero-Shot Reasoners? An Empirical Study with the MME-CoF Benchmark",
    "url": "http://arxiv.org/abs/2510.26802v1",
    "arxiv_id": "2510.26802v1",
    "authors": [
      "Ziyu Guo",
      "Xinyan Chen",
      "Renrui Zhang",
      "Ruichuan An",
      "Yu Qi",
      "Dongzhi Jiang",
      "Xiangtai Li",
      "Manyuan Zhang",
      "Hongsheng Li",
      "Pheng-Ann Heng"
    ],
    "published": "2025-10-30T17:59:55+00:00",
    "summary": "Recent video generation models can produce high-fidelity, temporally coherent videos, indicating that they may encode substantial world knowledge. Beyond realistic synthesis, they also exhibit emerging behaviors indicative of visual perception, modeling, and manipulation. Yet, an important question still remains: Are video models ready to serve as zero-shot reasoners in challenging visual reasoning scenarios? In this work, we conduct an empirical study to comprehensively investigate this question, focusing on the leading and popular Veo-3. We evaluate its reasoning behavior across 12 dimensions, including spatial, geometric, physical, temporal, and embodied logic, systematically characterizing both its strengths and failure modes. To standardize this study, we curate the evaluation data into MME-CoF, a compact benchmark that enables in-depth and thorough assessment of Chain-of-Frame (CoF) reasoning. Our findings reveal that while current video models demonstrate promising reasoning patterns on short-horizon spatial coherence, fine-grained grounding, and locally consistent dynamics, they remain limited in long-horizon causal reasoning, strict geometric constraints, and abstract logic. Overall, they are not yet reliable as standalone zero-shot reasoners, but exhibit encouraging signs as complementary visual engines alongside dedicated reasoning models. Project page: https://video-cof.github.io"
  },
  {
    "title": "OmniX: From Unified Panoramic Generation and Perception to Graphics-Ready 3D Scenes",
    "url": "http://arxiv.org/abs/2510.26800v1",
    "arxiv_id": "2510.26800v1",
    "authors": [
      "Yukun Huang",
      "Jiwen Yu",
      "Yanning Zhou",
      "Jianan Wang",
      "Xintao Wang",
      "Pengfei Wan",
      "Xihui Liu"
    ],
    "published": "2025-10-30T17:59:51+00:00",
    "summary": "There are two prevalent ways to constructing 3D scenes: procedural generation and 2D lifting. Among them, panorama-based 2D lifting has emerged as a promising technique, leveraging powerful 2D generative priors to produce immersive, realistic, and diverse 3D environments. In this work, we advance this technique to generate graphics-ready 3D scenes suitable for physically based rendering (PBR), relighting, and simulation. Our key insight is to repurpose 2D generative models for panoramic perception of geometry, textures, and PBR materials. Unlike existing 2D lifting approaches that emphasize appearance generation and ignore the perception of intrinsic properties, we present OmniX, a versatile and unified framework. Based on a lightweight and efficient cross-modal adapter structure, OmniX reuses 2D generative priors for a broad range of panoramic vision tasks, including panoramic perception, generation, and completion. Furthermore, we construct a large-scale synthetic panorama dataset containing high-quality multimodal panoramas from diverse indoor and outdoor scenes. Extensive experiments demonstrate the effectiveness of our model in panoramic visual perception and graphics-ready 3D scene generation, opening new possibilities for immersive and physically realistic virtual world generation."
  },
  {
    "title": "Masked Diffusion Captioning for Visual Feature Learning",
    "url": "http://arxiv.org/abs/2510.26799v1",
    "arxiv_id": "2510.26799v1",
    "authors": [
      "Chao Feng",
      "Zihao Wei",
      "Andrew Owens"
    ],
    "published": "2025-10-30T17:59:46+00:00",
    "summary": "We learn visual features by captioning images with an image-conditioned masked diffusion language model, a formulation we call masked diffusion captioning (MDC). During training, text tokens in each image-caption pair are masked at a randomly chosen ratio, and a decoder conditioned on visual features is trained to reconstruct the original text. After training, the learned visual features can be applied to downstream vision tasks. Unlike autoregressive captioning, the strength of the visual learning signal in MDC does not depend on each token's position in the sequence, reducing the need for auxiliary objectives. Linear probing experiments across a variety of academic-scale models and datasets show that the learned visual features are competitive with those produced by autoregressive and contrastive approaches."
  },
  {
    "title": "SEE4D: Pose-Free 4D Generation via Auto-Regressive Video Inpainting",
    "url": "http://arxiv.org/abs/2510.26796v1",
    "arxiv_id": "2510.26796v1",
    "authors": [
      "Dongyue Lu",
      "Ao Liang",
      "Tianxin Huang",
      "Xiao Fu",
      "Yuyang Zhao",
      "Baorui Ma",
      "Liang Pan",
      "Wei Yin",
      "Lingdong Kong",
      "Wei Tsang Ooi",
      "Ziwei Liu"
    ],
    "published": "2025-10-30T17:59:39+00:00",
    "summary": "Immersive applications call for synthesizing spatiotemporal 4D content from casual videos without costly 3D supervision. Existing video-to-4D methods typically rely on manually annotated camera poses, which are labor-intensive and brittle for in-the-wild footage. Recent warp-then-inpaint approaches mitigate the need for pose labels by warping input frames along a novel camera trajectory and using an inpainting model to fill missing regions, thereby depicting the 4D scene from diverse viewpoints. However, this trajectory-to-trajectory formulation often entangles camera motion with scene dynamics and complicates both modeling and inference. We introduce SEE4D, a pose-free, trajectory-to-camera framework that replaces explicit trajectory prediction with rendering to a bank of fixed virtual cameras, thereby separating camera control from scene modeling. A view-conditional video inpainting model is trained to learn a robust geometry prior by denoising realistically synthesized warped images and to inpaint occluded or missing regions across virtual viewpoints, eliminating the need for explicit 3D annotations. Building on this inpainting core, we design a spatiotemporal autoregressive inference pipeline that traverses virtual-camera splines and extends videos with overlapping windows, enabling coherent generation at bounded per-step complexity. We validate See4D on cross-view video generation and sparse reconstruction benchmarks. Across quantitative metrics and qualitative assessments, our method achieves superior generalization and improved performance relative to pose- or trajectory-conditioned baselines, advancing practical 4D world modeling from casual videos."
  },
  {
    "title": "Scaling Image Geo-Localization to Continent Level",
    "url": "http://arxiv.org/abs/2510.26795v1",
    "arxiv_id": "2510.26795v1",
    "authors": [
      "Philipp Lindenberger",
      "Paul-Edouard Sarlin",
      "Jan Hosang",
      "Matteo Balice",
      "Marc Pollefeys",
      "Simon Lynen",
      "Eduard Trulls"
    ],
    "published": "2025-10-30T17:59:35+00:00",
    "summary": "Determining the precise geographic location of an image at a global scale remains an unsolved challenge. Standard image retrieval techniques are inefficient due to the sheer volume of images (>100M) and fail when coverage is insufficient. Scalable solutions, however, involve a trade-off: global classification typically yields coarse results (10+ kilometers), while cross-view retrieval between ground and aerial imagery suffers from a domain gap and has been primarily studied on smaller regions. This paper introduces a hybrid approach that achieves fine-grained geo-localization across a large geographic expanse the size of a continent. We leverage a proxy classification task during training to learn rich feature representations that implicitly encode precise location information. We combine these learned prototypes with embeddings of aerial imagery to increase robustness to the sparsity of ground-level data. This enables direct, fine-grained retrieval over areas spanning multiple countries. Our extensive evaluation demonstrates that our approach can localize within 200m more than 68\\% of queries of a dataset covering a large part of Europe. The code is publicly available at https://scaling-geoloc.github.io."
  }
]